---
kind: type
id: T:Autodesk.Revit.DB.OptionalFunctionalityUtils
source: html/98d35b3b-34ec-4105-f7c5-16e9215b6b52.htm
---
# Autodesk.Revit.DB.OptionalFunctionalityUtils

A collection of utilities that can be used to determine if a particular set of functionality is installed and available.

## Syntax (C#)
```csharp
public static class OptionalFunctionalityUtils
```